РемонтПК_Конфигурация/src/Documents/ЗакупкаЗапчастей/ЗакупкаЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаЗапчастей</name>
  <registerRecords>AccumulationRegister.ОстаткиЗапчастей</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказ</name>
    <attributes>
      <name>Запчасть</name>
      <type>
        <types>CatalogRef.ТоварыНаСкладе</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РемонтПК_Конфигурация/src/Documents/ЗакупкаЗапчастей/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаказКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Заказ.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Стоимость;
	РассчитатьСуммуЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказСтоимостьПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Заказ.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Стоимость;
	РассчитатьСуммуЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуЗакупки()
	Объект.Сумма = 0;
	Для Каждого Строка Из Объект.Заказ Цикл
		Объект.Сумма = Объект.Сумма + Строка.Сумма;
	КонецЦикла;
КонецПроцедуры
